#include <QtGui>
#include "imagelabel.h"


imageLabel::imageLabel(int maxIW,int maxIH, QScrollArea *parentScrollArea,QStatusBar *parentStatusBar, QWidget *parent):QWidget(parent)
{
	baseImg = new QImage(maxIW, maxIH, QImage::Format_Indexed8);// СЃРѕР·РґР°РµРј РѕР±СЉРµРєС‚ baseImg (РІРёСЂС‚СѓР°Р»СЊРЅС‹Р№ СЌРєСЂР°РЅ РёР»Рё "Р±СѓС„РµСЂ РїСЂРѕСЂРёСЃРѕРІРєРё") РєР°Рє РёРЅРґРµРєСЃРёСЂРѕРІР°РЅРЅС‹Р№ 8-Р±РёС‚РЅС‹Р№ СЂРёСЃСѓРЅРѕРє (QImage::Format_Indexed8)
	QVector<QRgb> colormap;// С†РІРµС‚РѕРІР°СЏ РїР°Р»РёС‚СЂР° РґР»СЏ baseImg. РўРѕ РµСЃС‚СЊ РІРјРµСЃС‚Рѕ С‚РѕРіРѕ, С‡С‚РѕР±С‹ РёРјРµС‚СЊ С‡РµС‚С‹СЂРµ Р±Р°Р№С‚Р° РЅР° РїРёРєСЃРµР»СЊ (rgba) Сѓ РЅР°СЃ РѕРґРёРЅ Р±Р°Р№С‚ РЅР° РїРёРєСЃРµР»СЊ, Рё С†РІРµРєС‚ РїРёРєСЃРµР»СЏ (rgb) Р·Р°РґР°РµС‚СЃСЏ СѓРєР°Р·Р°РЅРёРµРј РёРЅРґРµРєСЃР° РІ РјР°СЃСЃРёРІРµ colormap (РїР°Р»РёС‚СЂРµ). Р­С‚Рѕ РЅР°Р·С‹РІР°РµС‚СЃСЏ "РёРЅРґРµРєСЃРёСЂРѕРІР°РЅРЅС‹Рµ С†РІРµС‚Р°". Р­С‚Рѕ РѕС‡РµРЅСЊ СѓРІРµР»РёС‡РёРІР°РµС‚ СЃРєРѕСЂРѕСЃС‚СЊ РїСЂРѕСЂРёСЃРѕРІРєРё.
    for (int k=0; k<256;k++) colormap << qRgb(k,k,k);// Р·Р°РїРѕР»РЅСЏРµРј РјР°СЃСЃРёРІС‡РёРє colormap С†РІРµС‚Р°РјРё - РіСЂР°РґР°С†РёСЏРјРё СЃРµСЂРѕРіРѕ(РѕС‚ С‡РµСЂРЅРѕРіРѕ (0) РґРѕ Р±РµР»РѕРіРѕ (255))
	baseImg->setColorTable(colormap);//"РїРѕРґРєР»СЋС‡Р°РµРј РїР°Р»РёС‚СЂСѓ"
	setAutoFillBackground(false);// Р·Р°РїСЂРµС‰Р°РµРј Р°РІС‚РѕРјР°С‚РёС‡РµСЃРєРѕРµ Р·Р°РїРѕР»РЅРµРЅРёРµ С„РѕРЅРѕРІС‹Рј С†РІРµС‚РѕРј РґР»СЏ СѓСЃРєРѕСЂРµРЅРёСЏ РїСЂРѕСЂРёСЃРѕРІРєРё
	maxImgWidth = maxIW;//СѓСЃС‚Р°РЅР°РІР»РёРІР°РµРј РјР°РєСЃРёРјР°Р»СЊРЅС‹Рµ СЂР°Р·РјРµСЂС‹ РґР»СЏ "Р±СѓС„РµСЂР° РїСЂРѕСЂРёСЃРѕРІРєРё"
	maxImgHeight = maxIH;
	//////////////////////////
	frameIndex = 0;//РќР°С‡Р°Р»СЊРЅРѕРµ Р·РЅР°С‡РµРЅРёРµ С‚РµРєСѓС‰РµРіРѕ РёРЅРґРµРєСЃР° СЂР°РІРЅРѕ 0
	scale = 1;// РјР°СЃС€С‚Р°Р± СЂР°РІРµРЅ 1
	sa = parentScrollArea;
	sb = parentStatusBar;
	cX = 0;
	cY = 0;
	aperture = 10;
	focusX = 0;
	focusY = 0;
	viewHist = 0;
	viewAperture = 0;
        viewFoundStars=1;
	viewPSF = 0;
	psfmodel = 1;
}

void imageLabel::paintEvent(QPaintEvent *event)//СЃРѕР±С‹С‚РёРµ РїСЂРѕСЂРёСЃРѕРІРєРё
{
	QPainter painter(this);// РѕР±СЉРµРєС‚ QPainter РґР»СЏ СЂР°Р±РѕС‚С‹ СЃ РёР·РѕР±СЂР°Р¶РµРЅРёРµРј (РєРѕРїРёСЂРѕРІР°РЅРёСЏ СЃ РІРёСЂС‚СѓР°Р»СЊРЅРѕРіРѕ СЌРєСЂР°РЅР° РЅР° СЂРµР°Р»СЊРЅС‹Р№ (imagelabel)). Р